13/data/attachments/2ebba0bb5c9d2d2e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:updateUserRequest>
            <nif:user>
                <nif:id>25e09155-237b-4d02-939a-81e834f9fba3</nif:id>
                <nif:username>soap_user_dc60fed8-cc29-43b0-a3d2-07e1ccab9c1b</nif:username>
                <nif:currency>KZT</nif:currency>
                
                
                
                
                &lt;nif:fullName&gt;{ Steven Williams }&lt;/nif:fullName&gt;
                
            </nif:user>
        </nif:updateUserRequest>
    </soapenv:Body>
</soapenv:Envelope>